age=25                    # ตัวเลขจำนวนเต็ม (Integer)
weight=66.6               # ตัวเลขทศนิยม (Float)
first_name="ปรัชญา"       # ข้อความ
has_notebook= True        # Boolean มีค่า2แบบคือ true , false

#ตัวแปร ex
x=4
y=2
Z= x+y
print(Z)
#แปลงข้อมูลเป็นจำนวนเต็ม,ทศนิยม,แปลงเป็นข้อความ
x=int("4")    
y=float("2")
a=str(12)
s=2
z=x+y
print(Z)

print("เครื่องหมายคำนวน")####################################################################################################################################
x=5
y=2
a1=x+y          #7              บวก
a2=x-y          #3              ลบ
a3=x*y          #10             คูณ
a4=x/y          #2.5            หาร
a5=x%y          #1              หาเศษจากการหาร
a6=x**y         #25             ยกกำลัง
a7=x//y         #2              หารแบบปัดเศษทิ้ง

print("เครื่องหมายคำนวนแบบshortcut")####################################################################################################################################
x=5
x=x+3 
   #เท่ากันกับ
x+=3   #   ,-=,*=,/=


print("เครืองหมายเปรียบเทียบ")####################################################################################################################################
x=8
y=4
a1= x>y      #True
a2= x>=y     #True

a3= x<y      #False
a4= x<=y     #False

a5= x==y     #False
a6= x!=y     #True        **** == แปลว่า มีค่าเท่ากับ / != แปลว่า มีค่าไม่เท่ากับ


print("เครื่องหมายเปรียบเทียบทางตรรกศาสตร์")####################################################################################################################################
p=True
q=False

a1= p and q #False
a2= p or q  #True
a3= not p   #False






print("การตรวจสอบเงื่อนไข")####################################################################################################################################
score=85

print("if ตามด้วยtrue หรือ false")
if score >=80:
    print("Grade A")  #แปลว่า ถ้าคะเเนนมากกว่าหรือเท่ากับ80 = เกรดA
    print("้เก่งมากครับฟูก")

print("elif การตรวจสอบเงื่อนไขข้างบน ถ้าข้างบนตรวจสอบผ่าน จะไม่ลงมาที่ elif")
score1=77
if score1 >=80:
        print("Grade A") 
elif score1 >=70:
      print("GradeB") #แปลว่า ถ้าคะเเนนมากกว่าหรือเท่ากับ70 = เกรดB

print("else คือ ถ้าไม่ผ่านการตรวจสอบสักตัว จะมาที่ตัวนี้เป็นตัวสุดท้าย")
score2=68
if score2 >=80:
        print("Grade A") 
elif score2 >=70:
      print("GradeB")
else:
      print("GradeF")






print("การวนลูป")###############################################################################################################################################
for i in range(3):
      print(i)    # i จะไปรับค่า 0 มาก่อนเเละวนลูปไปรับค่า 2 เเละ 3 

double=i*2
print(double) #คือการนำผลของลูปมา*2

print("กำหนดให้ลูปเริ่มที่ตัวเลขใดๆ")
for i in range(1, 4):   #1 คือเลขที่เริ่ม 4 คือจำนวนลูป(4ลูปตัด0เหลือ3)
      print(i)  

print("******************")

      #continue ใช้ข้าม loop รอบนั้น
for i in range(1, 7):
      if i%3==0:     # คือ ตัวเลขที่หารด้วย 3 ลงตัว
            continue
      print(i)

print("******************")

      #break จะหยุดการทำงานของ loop นั้นทันที
for i in range(1, 7):
      if i%3==0:     # คือ ตัวเลขที่หารด้วย 3 ลงตัว
            break
      print(i)




print("ฟังก์ชัน (def)")###############################################################################################################################################
def get_box_aera():                   #def ชื่อฟังก์ชัน(พารา1,พารา2,พารา3):
      width=4
      lenght=4
      height=2
      box_aera=width*lenght*height
      print(box_aera)

get_box_aera()   

print("******************")
def get_box_aera(width,lenght,height):                 
      box_aera=width*lenght*height
      print(box_aera)

get_box_aera(4,4,2)           #สามารถใส่ได้มากกว่า1
get_box_aera(1,1,1)
get_box_aera(width=1,height=1,lenght=1)   


print("******************")

def get_box_aera(width,lenght,height):   
      if width<0 or lenght<0 or height <0:
            return 0              
      box_aera=width*lenght*height
      return box_aera
    
box1=get_box_aera(4,3,2)   #24           
box2=get_box_aera(width=1,height=1,lenght=1)   
print(box1)